#把從TWSE的資料全部抓下來到 TXT檔


import requests
from io import StringIO
import pandas as pd
import numpy as np

def fetch(datestr):
    response = requests.post('http://www.twse.com.tw/exchangeReport/MI_INDEX?response=csv&date=' + datestr + '&type=ALL')
    return response

def sort_out(datestr):
    #datestr='20181116'
    resp = fetch(datestr)
    
    path=r"C:\Users\s4017\Desktop\test.txt" #prefix the string with r (to produce a raw string) 
    fout=open(path,'w')
    for i in resp.text.split('\n'):
        block=i.split('",')
        if len(block) == 17 and i[0] != '=':
            del block[16] #del '\r'
            fstock=(block[0]+block[1]).translate({ord(c): None for c in '"'}) #1101台泥
            fout.write('\n')
            for b1 in block:
                b1clr=b1.translate({ord(c): None for c in '"'})
                pattern = '%s%s'
                padding = ' ' * (20 - calc_len(b1clr)) #import calc_len
                fout.write(pattern % (padding,b1clr))
    fout.close()   
    
sort_out('20190118')
#print(a)



___________________________________________________

result:

           證券代號            證券名稱            成交股數            成交筆數            成交金額              開盤價              最高價              最低價              收盤價           漲跌(+/-)            漲跌價差        最後揭示買價        最後揭示買量        最後揭示賣價        最後揭示賣量              本益比
                1101                台泥          10,088,263               3,421         361,901,018               35.80               36.00               35.55               36.00                   +                0.55               35.95                  93               36.00                 112                9.89
                1102                亞泥           8,428,083               3,348         303,285,413               35.80               36.20               35.60               36.15                   +                0.45               36.10                   9               36.15                  49               11.06
                1103                嘉泥             408,215                 105           5,612,688               13.70               13.80               13.70               13.75                                    0.00               13.75                  25               13.80                  73                4.86
                1104                環泥              45,995                  32             868,401               18.90               18.90               18.85               18.90                   +                0.05               18.85                  12               18.95                  36               10.80
                1108                幸福              41,000                  15             302,650                7.36                7.40                7.36                7.40                   +                0.05                7.40                   2                7.42                   3                0.00
                1109                信大              24,100                  15             334,494               13.95               13.95               13.85               13.90                   -                0.05               13.85                   4               13.95                  11                6.56
                1110                東泥               3,000                   3              46,200               15.40               15.40               15.40               15.40                                    0.00               15.30                   3               15.35                   5               61.60
                1201                味全             371,692                 237           8,421,746               22.60               22.80               22.55               22.55                   +                0.05               22.55                   5               22.60                  21                7.14
                1203                味王               6,729                  16             175,424               25.90               26.10               25.90               26.10                   +                0.20               25.95                   3               26.10                   1               14.42
                1210                大成             988,424                 716          34,468,348               35.00               35.00               34.80               34.80                   -                0.10               34.80                  54               34.85                   6               11.26
                1213                大飲              22,401                  15             225,520               10.00               10.15               10.00               10.05                   +                0.05               10.00                  22               10.15                  21                0.00
                1215                卜蜂             505,377                 340          27,210,609               53.80               54.00               53.60               53.80                   +                0.30               53.80                  19               53.90                  20               14.08
                1216                統一           6,172,520               3,004         446,203,368               72.90               72.90               72.10               72.10                   -                0.80               72.10                  12               72.20                  25               10.30
                1217              愛之味             294,214                 103           2,043,288                6.96                6.97                6.93                6.94                   +                0.01                6.94                  72                6.96                  14               17.35
                1218                泰山             401,587                 213           7,241,116               18.10               18.10               18.00               18.00                                    0.00               17.95                  36               18.00                   5               19.78
                1219                福壽              37,442                  25             675,956               18.10               18.15               18.00               18.15                   +                0.15               18.00                  17               18.15                   9              106.76
                1220                台榮              91,000                  45             995,850               11.00               11.05               10.90               11.00                                    0.00               10.95                   1               11.00                  10               22.92
                1225              福懋油             224,667                  11          15,293,055               71.50               73.00               71.50               73.00                   +                1.50               72.50                   1               73.00                   4               90.12
